hathach/tinyusb/hw/bsp/at32f402_405/boards/AT_START_F402_405/AT32F405xx_v2.svd
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCTESEL</name>
              <description>Low bit of trigger event select for ordinary channels conversion</description>

              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PCTEN</name>

              <description>Trigger mode enable for preempted channels conversion</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCTESEL</name>
              <description>Low bit of trigger event select for preempted channels conversion</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>DTALIGN</name>
              <description>Data alignment</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OCDMAEN</name>
              <description>DMA transfer enable of ordinary channels</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCALINIT</name>
              <description>initialize A/D calibration</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCAL</name>
              <description>A/D Calibration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RPEN</name>
              <description>Repeat mode enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCEN</name>
              <description>A/D converter enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        
        <register>
          <name>SPT1</name>
          <displayName>SPT1</displayName>
          <description>sample time register 1</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSPT17</name>
              <description>Selection sample time of channel ADC_IN17</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT16</name>
              <description>Selection sample time of channel ADC_IN16</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT15</name>
              <description>Selection sample time of channel ADC_IN15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT14</name>
              <description>Selection sample time of channel ADC_IN14</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT13</name>
              <description>Selection sample time of channel ADC_IN13</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT12</name>
              <description>Selection sample time of channel ADC_IN12</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT11</name>
              <description>Selection sample time of channel ADC_IN11</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT10</name>
              <description>Selection sample time of channel ADC_IN10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SPT2</name>
          <displayName>SPT2</displayName>
          <description>sample time register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CSPT9</name>
              <description>Selection sample time of channel ADC_IN9</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT8</name>
              <description>Selection sample time of channel ADC_IN8</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT7</name>
              <description>Selection sample time of channel ADC_IN7</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT6</name>
              <description>Selection sample time of channel ADC_IN6</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT5</name>
              <description>Selection sample time of channel ADC_IN5</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT4</name>
              <description>Selection sample time of channel ADC_IN4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT3</name>
              <description>Selection sample time of channel ADC_IN3</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT2</name>
              <description>Selection sample time of channel ADC_IN2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT1</name>
              <description>Selection sample time of channel ADC_IN1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>CSPT0</name>
              <description>Selection sample time of channel ADC_IN0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDTO1</name>
          <displayName>PCDTO1</displayName>
          <description>Preempted channel 1 data offset register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCDTO1</name>
              <description>Data offset for Preempted channel 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDTO2</name>
          <displayName>PCDTO2</displayName>
          <description>Preempted channel 2 data offset register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCDTO2</name>
              <description>Data offset for Preempted channel 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDTO3</name>
          <displayName>PCDTO3</displayName>
          <description>Preempted channel 3 data offset register</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCDTO3</name>
              <description>Data offset for Preempted channel 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PCDTO4</name>
          <displayName>PCDTO4</displayName>
          <description>Preempted channel 4 data offset register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCDTO4</name>
              <description>Data offset for Preempted channel 4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VMHB</name>
          <displayName>VMHB</displayName>
          <description>Voltage monitoring high boundary register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000FFF</resetValue>
          <fields>
            <field>
              <name>VMHB</name>
              <description>Voltage monitoring high boundary</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>VMLB</name>
          <displayName>VMLB</displayName>
          <description>Voltage monitoring low boundary register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VMLB</name>
              <description>Voltage monitoring low boundary</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSQ1</name>
          <displayName>OSQ1</displayName>
          <description>Ordinary sequence register 1</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OCLEN</name>
              <description>Ordinary conversion sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>OSN16</name>
              <description>Number of 16th conversion in ordinary sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN15</name>
              <description>Number of 15th conversion in ordinary sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN14</name>
              <description>Number of 14th conversion in ordinary sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN13</name>
              <description>Number of 13th conversion in ordinary sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSQ2</name>
          <displayName>OSQ2</displayName>
          <description>Ordinary sequence register 2</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSN12</name>
              <description>Number of 12th conversion in ordinary sequence</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN11</name>
              <description>Number of 11th conversion in ordinary sequence</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN10</name>
              <description>Number of 10th conversion in ordinary sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN9</name>
              <description>Number of 8th conversion in ordinary sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN8</name>
              <description>Number of 7th conversion in ordinary sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN7</name>
              <description>Number of 13th conversion in ordinary sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OSQ3</name>
          <displayName>OSQ3</displayName>
          <description>Ordinary sequence register 3</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OSN6</name>
              <description>Number of 6th conversion in ordinary sequence</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN5</name>
              <description>Number of 5th conversion in ordinary sequence</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN4</name>
              <description>Number of 4th conversion in ordinary sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN3</name>
              <description>number of 3rd conversion in ordinary sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN2</name>
              <description>Number of 2nd conversion in ordinary sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OSN1</name>
              <description>Number of 1st conversion in ordinary sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PSQ</name>
          <displayName>PSQ</displayName>
          <description>Preempted sequence register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PCLEN</name>
              <description>Preempted conversion sequence length</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PSN4</name>
              <description>Number of 4th conversion in Preempted sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PSN3</name>
              <description>Number of 3rd conversion in Preempted sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PSN2</name>
              <description>Number of 2nd conversion in Preempted sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PSN1</name>
              <description>Number of 1st conversion in Preempted sequence</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDT1</name>
          <displayName>PDT1</displayName>
          <description>Preempted data register 1</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDT1</name>
              <description>Preempted data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDT2</name>
          <displayName>PDT2</displayName>
          <description>Preempted data register 2</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDT2</name>
              <description>Preempted data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDT3</name>
          <displayName>PDT3</displayName>
          <description>Preempted data register 3</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDT3</name>
              <description>Preempted data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PDT4</name>
          <displayName>PDT4</displayName>
          <description>Preempted data register 4</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDT4</name>
              <description>Preempted data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ODT</name>
          <displayName>ODT</displayName>
          <description>Ordinary data register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ODT</name>
              <description>Conversion data of ordinary channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OVSP</name>
          <displayName>OVSP</displayName>
          <description>oversampling register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OOSRSEL</name>
              <description>Ordinary oversampling recovery mode select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OOSTREN</name>
              <description>Ordinary oversampling trigger mode enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSSSEL</name>
              <description>Oversampling shift select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>OSRSEL</name>
              <description>Oversampling ratio select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>POSEN</name>
              <description>Preempted oversampling enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OOSEN</name>
              <description>Ordinary oversampling enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
